Repository: common-repository/nusvg
Catalog: lang/nusvg-*.po
Languages: fr_fr

source: Credits
fr_fr: Crédits

source: Example SVG is missing, sorry.
fr_fr: Désolé. L'exemple n'a pas été trouvé.

source: Display SVG
fr_fr: Affichage du SVG

source: Parameters
fr_fr: Paramètres

source: You can declare <b>parameters</b> in your SVG file in order to dynamically customize your SVG.
fr_fr: Vous pouvez déclarer des <b>paramètres</b> dans votre fichier SVG afin de le configurer dynamiquement.

source: Syntax
fr_fr: Syntaxe

source: Example
fr_fr: Exemple

source: Use of parameters
fr_fr: Utilisation de paramètres

source: Retrieve values
fr_fr: Récupération des valeurs

source: Method %s (or %s for echo) is useful.
fr_fr: La méthode %s (ou %s pour un echo) est utile.

source: Any custom parameter
fr_fr: N'importe quel paramètre

source: SVG in base64
fr_fr: SVG en base64

source: Get URL
fr_fr: Obtenir l'URL

source: Get SVG in base64
fr_fr: Obtenir le SVG en base64

source: Respect image ratio
fr_fr: Respecter le ratio de l'image

source: When changing default %s, you should give both width and height parameter, otherwise ratio won't be kept :
fr_fr: Si vous changez la valeur par défaut de %s, vous devrez fournir en paramètres à la fois width et height, sinon le ratio ne sera pas respecté :

source: Use %s as value for automatic calculus :
fr_fr: Utiliser %s comme valeur pour un calcul automatique :

source: ID disambiguation
fr_fr: Désambigüisation de l'ID

source: When using ID inside SVG, we should make them unique. This can be done by prefixing them with %s.
fr_fr: Quand on utilise un ID dans un fichier SVG, il faut s'assurer qu'il soit unique. C'est facilement faisable en le préfixant avec %s.

source: Need a summary of all parameters ? Use method %s !
fr_fr: Besoin d'un résumé de tous les paramètres ? Utilisons la méthode %s !

source: inline SVG background
fr_fr: background SVG en inline

source: Using a shortcode instead of PHP
fr_fr: En utilisant un shortcode plutôt que PHP

source: Parameters in JSON format :
fr_fr: Paramètres au format JSON :

source: Image license list
fr_fr: Synthèse des licences d'images

source: If you specified credits for your images, you can easily get a credit list to display on your site.%s Thanks to a shortcode : %s Or thanks to a PHP method : %s
fr_fr: Si vous avez spécifié des crédits pour vos images, vous pouvez facilement afficher une liste de crédits sur votre site.%s Grâce à un raccourci : %s Ou grâce à une méthode PHP : %s

source: Page not found
fr_fr: Page non trouvée

source: Back to list
fr_fr: Retour à la liste

source: Item
fr_fr: Élément

source: not found
fr_fr: non trouvé

source: Bad syntax
fr_fr: Syntaxe erronée

source: Slug already used
fr_fr: Ce slug est déjà pris

source: List
fr_fr: Liste

source: New item
fr_fr: Nouvelle image

source: Add
fr_fr: Ajouter

source: Size between %d and %d characters ; alphanumeric + underscores + hyphens
fr_fr: Taille entre %d et %d caractères ; alphanumérique + underscores + tirets

source: preview
fr_fr: aperçu

source: default size
fr_fr: taille par défaut

source: delete
fr_fr: supprimer

source: Troubleshooting
fr_fr: Dépannage

source: Done
fr_fr: Terminé

source: Refresh cache
fr_fr: Rafraîchir le cache

source: Uninstall
fr_fr: Désinstallation

source: To avoid erasure of useful data, SVG files are not deleted during uninstall process.
fr_fr: Pour éviter une perte de données, la désinstallation de cette extension ne supprimera pas les fichiers SVG.

source: After uninstalling this plugin, please manually delete this folder : %s
fr_fr: Après avoir désinstallé cette extension, veuillez supprimer manuellement ce répertoire : %s

source: You do not have sufficient permissions to access this page.
fr_fr: Vous n'avez pas les permissions suffisantes pour accéder à cette page.

source: Custom parameters
fr_fr: Paramètres personnels

source: Save
fr_fr: Enregistrer

source: Preview HTML
fr_fr: Aperçu HTML

source: Preview base64 (background)
fr_fr: Aperçu en base64 (background)

source: Not deletable (used in doc)
fr_fr: Non-supprimable (utilisé dans documentation)

source: Delete this item ?
fr_fr: Supprimer cet élément ?

source: Delete
fr_fr: Supprimer
